# StairstypeMaximumRiserHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeMaximumRiserHeight Property
ParameterTypeId Class See Also
---
"Max. Riser Height": Maximum Riser Height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeMaximumRiserHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeMaximumRiserHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeMaximumRiserHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace